user-service/app/controllers/users_controller.rb

  def create
    @user = User.new(name: params[:name], email: params[:email])

    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Jorge Castro"], ["email", "jorge.castro@gmail.com"], ["created_at", "2015-05-06 00:11:46.510654"], ["updated_at", "2015-05-06 00:11:46.510654"]]

  def comments
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]