comment-service/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(author_id: params[:author_id], body: params[:body])
    if @comment.save
---
INSERT INTO "comments" ("author_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["author_id", 2], ["body", "This is the fourth post"], ["created_at", "2015-05-06 00:29:08.703589"], ["updated_at", "2015-05-06 00:29:08.703589"]]

  def by_author
    @comments = Comment.where(author_id: params[:author_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."author_id" = ?  [["author_id", 1]]